In [7]:
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset
load_dataset("lukebarousse/data_jobs")

DatasetDict({
    train: Dataset({
        features: ['job_title_short', 'job_title', 'job_location', 'job_via', 'job_schedule_type', 'job_work_from_home', 'search_location', 'job_posted_date', 'job_no_degree_mention', 'job_health_insurance', 'job_country', 'salary_rate', 'salary_year_avg', 'salary_hour_avg', 'company_name', 'job_skills', 'job_type_skills'],
        num_rows: 785741
    })
})

In [10]:
df = dataset["train"].to_pandas()

Empty DataFrame
Columns: [salary_rate, salary_year_avg, salary_hour_avg]
Index: []

In [17]:
df.loc[:, "salary_rate":"salary_hour_avg"].dropna(subset = ["salary_rate", "salary_hour_avg"])

       salary_rate  salary_year_avg  salary_hour_avg
43            hour              NaN        97.500000
51            hour              NaN        72.500000
253           hour              NaN        88.000000
294           hour              NaN        52.500000
340           hour              NaN        67.500000
...            ...              ...              ...
784068        hour              NaN        54.420002
784267        hour              NaN        61.159996
785111        hour              NaN        61.159996
785476        hour              NaN        47.620003
785492        hour              NaN        47.620003

[10662 rows x 3 columns]

In [18]:
median_salary_avg = df["salary_year_avg"].median()
median_salary_avg

115000.0

In [19]:
median_hourly_salary = df["salary_hour_avg"].median()
median_hourly_salary

45.97999954223633

In [20]:
df_cleaned = df

In [22]:
df_cleaned["salary_year_avg"] = df_cleaned["salary_year_avg"].fillna(median_salary_avg)

In [23]:
df_cleaned["salary_hour_avg"] = df_cleaned["salary_hour_avg"].fillna(median_hourly_salary)

In [24]:
df_cleaned.loc[:10, "salary_year_avg":"salary_hour_avg"]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [25]:
df_unique = df_cleaned

In [33]:
df_unique = df_unique.drop_duplicates()

In [34]:
print("length of original dataframe: ", len(df_cleaned))
print('length of modified dataframe: ', len(df_unique))
print('length of final dataframe: ', len(df_cleaned)- len(df_unique))

length of original dataframe:  785741
length of modified dataframe:  785640
length of final dataframe:  101

In [36]:
df_unique = df_unique.drop_duplicates(subset = ["job_title", "company_name"])
print("length of original dataframe: ", len(df_cleaned))
print('length of modified dataframe: ', len(df_unique))
print('length of final dataframe: ', len(df_cleaned)- len(df_unique))

length of original dataframe:  785741
length of modified dataframe:  508042
length of final dataframe:  277699